test/data/xml/XMLSwissindexPharma-DE.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <PHARMA xmlns="http://swissindex.e-mediat.net/SwissindexPharma_out_V101" CREATION_DATETIME="2013-12-10T10:09:26.8198427+01:00">
      <!-- spec/data/swissindex_pharma.xml. Values for spec/builder_spec.rb -->
      CREATION_DATETIME="2012-10-18T06:31:19.4687619+02:00"
      xmlns="http://example.com/test">
      <ITEM DT="2014-10-17T00:00:00">
        <GTIN>8888650404193</GTIN>
        <PHAR>131736</PHAR>
        <STATUS>A</STATUS>
        <STDATE>2002-06-25T00:00:00</STDATE>
        <LANG>DE</LANG>
        <DSCR>TIGER BALM Salbe rot-stark</DSCR>
        <ADDSCR>Topf 19.4 g</ADDSCR>
        <ATC>M02AX10</ATC>
        <COMP>
          <NAME>Doetsch Grether AG</NAME>
          <GLN>7614700999989</GLN>
        </COMP>
      </ITEM>
      <ITEM DT="2014-10-17T00:00:00">
        <GTIN>7680565040012</GTIN>
        <PHAR>1914297</PHAR>
        <STATUS>A</STATUS>
        <STDATE>1997-10-13T00:00:00</STDATE>
        <LANG>DE</LANG>
        <DSCR>AQUA AD INJ Amino Inj Lös 2ml Amp</DSCR>
        <ADDSCR>10 Stk</ADDSCR>
        <ATC>V07AB</ATC>
        <COMP>
          <NAME>Amino AG</NAME>
          <GLN>7601001392571</GLN>
        </COMP>
      </ITEM>
       <RESULT>
        <OK_ERROR>OK</OK_ERROR>
        <NBR_RECORD>2</NBR_RECORD>
      </RESULT>
    </PHARMA>
  </soap:Body>
</soap:Envelope>
