spec/data/swissindex_pharma.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <PHARMA xmlns="http://swissindex.e-mediat.net/SwissindexPharma_out_V101" CREATION_DATETIME="2013-12-10T10:09:26.8198427+01:00">
      <!-- spec/data/swissindex_pharma.xml. Values for spec/builder_spec.rb -->
      CREATION_DATETIME="2012-10-18T06:31:19.4687619+02:00"
      xmlns="http://example.com/test">
      <ITEM DT="2013-06-22T00:00:00">
        <GTIN>7680536620137</GTIN>
        <PHAR>1699947</PHAR>
        <STATUS>A</STATUS>
        <STDATE>1996-03-20T00:00:00</STDATE>
        <LANG>DE</LANG>
        <DSCR>3TC Filmtabl 150 mg</DSCR>
        <ADDSCR>60 Stk</ADDSCR>
        <ATC>J05AF05</ATC>
        <COMP>
          <NAME>ViiV Healthcare GmbH</NAME>
          <GLN>7601001392175</GLN>
        </COMP>
      </ITEM>
      <ITEM DT="2013-12-06T00:00:00">
        <GTIN>7680620690084</GTIN>
        <PHAR>5819012</PHAR>
        <STATUS>A</STATUS>
        <STDATE>2013-10-26T00:00:00</STDATE>
        <LANG>DE</LANG>
        <DSCR>LEVETIRACETAM DESITIN Filmtabl 250 mg</DSCR>
        <ADDSCR>30 Stk</ADDSCR>
        <ATC>N03AX14</ATC>
        <COMP>
          <NAME>Desitin Pharma GmbH</NAME>
          <GLN>7601001320451</GLN>
        </COMP>
      </ITEM>
      <ITEM DT="2013-06-22T00:00:00">
        <GTIN>7680555580054</GTIN>
        <PHAR>2465312</PHAR>
        <STATUS>A</STATUS>
        <STDATE>2002-01-16T00:00:00</STDATE>
        <LANG>DE</LANG>
        <DSCR>ZYVOXID Filmtabl 600 mg</DSCR>
        <ADDSCR>10 Stk</ADDSCR>
        <ATC>J01XX08</ATC>
        <COMP>
          <NAME>Pfizer AG</NAME>
          <GLN>7601001010604</GLN>
        </COMP>
      </ITEM>
      <RESULT>
        <OK_ERROR>OK</OK_ERROR>
        <NBR_RECORD>2</NBR_RECORD>
      </RESULT>
    </PHARMA>
  </soap:Body>
</soap:Envelope>
